src/DataProcessors/ФормированиеЗаказовПоставщикам/ФормированиеЗаказовПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеЗаказовПоставщикам</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПродаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднедневноеПотребление</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказыКПоступлению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КЗаказу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Соглашение</name>
      <type>
        <types>CatalogRef.СоглашенияСПоставщиками</types>
      </type>
    </attributes>
    <attributes>
      <name>СвободныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказыКПоступлениюСвободные</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияШтучная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦеныПоставщика</name>
      <type>
        <types>CatalogRef.ВидыЦенПоставщиков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеПолучатель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Требуется</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КЗаказу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Обеспечено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Соглашение</name>
      <type>
        <types>CatalogRef.СоглашенияСПоставщиками</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦеныПоставщика</name>
      <type>
        <types>CatalogRef.ВидыЦенПоставщиков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/ФормированиеЗаказовПоставщикам/Forms/ВводЗначения/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТекстЗаполнить = НСтр("ru='Заполнить';uk='Заповнити'");

	Режим = Параметры.Режим;

	Если Режим = "МинимальныйОстаток" Тогда

		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОстаток;
		Заголовок = НСтр("ru='Заполнение минимального остатка';uk='Заповнення мінімального залишку'");
		Элементы.ПереключательОстаток.СписокВыбора.Добавить(0, НСтр("ru='Минимальный остаток:';uk='Мінімальний залишок:'"));
		Элементы.Команда.Заголовок = ТекстЗаполнить;
		Переключить(0);

	ИначеЕсли Режим = "МаксимальныйОстаток" Тогда

		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОстаток;
		Заголовок = НСтр("ru='Заполнение максимального остатка';uk='Заповнення максимального залишку'");
		Элементы.ПереключательОстаток.СписокВыбора.Добавить(0, НСтр("ru='Максимальный остаток:';uk='Максимальний залишок:'"));
		Элементы.Команда.Заголовок = ТекстЗаполнить;
		Элементы.Подсказка.Заголовок = СтрЗаменить(Элементы.Подсказка.Заголовок,
			НСтр("ru='Минимальный';uk='Мінімальний'"), НСтр("ru='Максимальный';uk='Максимальний'"));
		Переключить(0);

	ИначеЕсли Режим = "ПериодПродаж" Тогда

		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПериодПродаж;
		Заголовок = НСтр("ru='Установка периода расчета продаж';uk='Встановлення періоду розрахунку продажів'");

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)

	Переключить(0);

КонецПроцедуры

&НаКлиенте
Процедура Переключатель1ПриИзменении(Элемент)

	Переключить(1);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура Переключить(Индекс)

	Переключатель = Индекс;
	Элементы.Остаток.Доступность        = Переключатель = 0;

	Если Не Элементы.Остаток.Доступность Тогда
		Остаток = 0;
	Иначе
		КоличествоДней = 0;
	КонецЕсли;

	Элементы.КоличествоДней.Доступность = Переключатель = 1;
	Элементы.Подсказка.Доступность     = Переключатель = 1;
	Элементы.Команда.Заголовок = ?(Переключатель = 0, НСтр("ru='Заполнить';uk='Заповнити'"), НСтр("ru='Рассчитать и заполнить';uk='Розрахувати і заповнити'"));

КонецПроцедуры

&НаКлиенте
Процедура Команда(Команда)

	Результат = Новый Структура("Режим", Параметры.Режим);

	Если Параметры.Режим = "МинимальныйОстаток" Или Параметры.Режим = "МаксимальныйОстаток" Тогда

		Результат.Вставить("Рассчитывать", Переключатель = 1);
		Результат.Вставить("Значение",     ?(Переключатель = 0, Остаток, КоличествоДней));

	ИначеЕсли Параметры.Режим = "ПериодПродаж" Тогда

	КонецЕсли;

	ОповеститьОВыборе(Результат);

КонецПроцедуры

#КонецОбласти
